<a href="https://colab.research.google.com/github/matbot/pandas_practice/blob/master/pandas_multitable.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [16]:
import pandas as pd;

# Create/Import DataFrames

In [32]:
data = [
  [1,2,3,1,'2017-01-01'],
  [2,2,2,3,'2017-01-01'],
  [3,3,1,1,'2017-01-01'],
  [4,3,2,2,'2017-02-01'],
  [6,1,4,2,'2017-03-01'],
  [7,1,1,1,'2017-02-02'],
  [8,1,4,1,'2017-02-02']  
]
orders = pd.DataFrame(data, columns = ['order_id','customer_id','product_id','quantity','timestamp'])

orders.head()

   order_id  customer_id  product_id  quantity   timestamp
0         1            2           3         1  2017-01-01
1         2            2           2         3  2017-01-01
2         3            3           1         1  2017-01-01
3         4            3           2         2  2017-02-01
4         6            1           4         2  2017-03-01

In [22]:
products = pd.read_csv('https://raw.githubusercontent.com/dinhanhthi/data-science-learning/master/codecademy-data-science/course-10%20Data%20Analysis%20with%20Pandas/products.csv')
products.head()

   product_id         description  price
0           1      thing-a-ma-jig      5
1           2  whatcha-ma-call-it     10
2           3          doo-hickey      7
3           4               gizmo      3

In [19]:
customers = pd.read_csv('https://raw.githubusercontent.com/dinhanhthi/data-science-learning/master/codecademy-data-science/course-10%20Data%20Analysis%20with%20Pandas/customers.csv')
customers.head()

   customer_id customer_name        address  phone_number
0            1    John Smith   123 Main St.  212-123-4567
1            2      Jane Doe  456 Park Ave.  949-867-5309
2            3     Joe Schmo   798 Broadway  112-358-1321

# DataFrame Merging

## Inner Merge

In [36]:
orders_customers = pd.merge(orders, customers)
orders_customers.head()
multiple_order_customers = orders_customers[orders_customers.quantity > 1]
multiple_order_customers.head()

   order_id  customer_id  product_id  ...  customer_name        address  phone_number
1         2            2           2  ...       Jane Doe  456 Park Ave.  949-867-5309
3         4            3           2  ...      Joe Schmo   798 Broadway  112-358-1321
4         6            1           4  ...     John Smith   123 Main St.  212-123-4567

[3 rows x 8 columns]

In [41]:
orders_customers_products = orders.merge(customers).merge(products)
orders_customers_products.head()
multiple_whatchmacallits = orders_customers_products[(orders_customers_products.description == 'whatcha-ma-call-it') & (orders_customers_products.quantity > 1)]
multiple_whatchmacallits.head()

   order_id  customer_id  product_id  ...  phone_number         description price
1         2            2           2  ...  949-867-5309  whatcha-ma-call-it    10
2         4            3           2  ...  112-358-1321  whatcha-ma-call-it    10

[2 rows x 10 columns]

## Outer Merge, Left Merge, Right Merge

In [ ]:
## ab_all = pd.merge(a, b, how='outer')
## ab_all = a.merge(b, how='outer')
## ab_left = pd.merge(a, b, how='left')
## ab_right = pd.merge(a, b, how='right')

## Concatenate

In [ ]:
## a_and_b = pd.concat([a, b])